benchmark/results/test_1_empty_db_80k_requests.txt
httperf --hog --client=0/1 --server=192.168.9.142 --port=18080 --uri=/getall?keys=u* --rate=8000 --send-buffer=4096 --recv-buffer=16384 --method=GET --num-conns=80000 --num-calls=1
Maximum connect burst length: 164

Total: connections 80000 requests 80000 replies 80000 test-duration 9.995 s

Connection rate: 8003.6 conn/s (0.1 ms/conn, <=191 concurrent connections)
Connection time [ms]: min 0.1 avg 0.4 max 28.5 median 0.5 stddev 0.6
Connection time [ms]: connect 0.2
Connection length [replies/conn]: 1.000

Request rate: 8003.6 req/s (0.1 ms/req)
Request size [B]: 80.0

Reply rate [replies/s]: min 8002.8 avg 8002.8 max 8002.8 stddev 0.0 (1 samples)
Reply time [ms]: response 0.3 transfer 0.0
Reply size [B]: header 126.0 content 13.0 footer 0.0 (total 139.0)
Reply status: 1xx=0 2xx=80000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 1.28 system 8.27 (user 12.8% system 82.7% total 95.5%)
Net I/O: 1711.7 KB/s (14.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0