benchmark/results/test_2_1k_db_50k_requests.txt
httperf --hog --client=0/1 --server=192.168.9.142 --port=18080 --uri=/getall?keys=u* --rate=5000 --send-buffer=4096 --recv-buffer=16384 --method=GET --num-conns=50000 --num-calls=1
Maximum connect burst length: 98

Total: connections 50000 requests 50000 replies 50000 test-duration 10.002 s

Connection rate: 4998.8 conn/s (0.2 ms/conn, <=110 concurrent connections)
Connection time [ms]: min 0.1 avg 0.3 max 23.2 median 0.5 stddev 0.4
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 1.000

Request rate: 4998.8 req/s (0.2 ms/req)
Request size [B]: 80.0

Reply rate [replies/s]: min 4998.3 avg 4998.7 max 4999.2 stddev 0.6 (2 samples)
Reply time [ms]: response 0.2 transfer 0.0
Reply size [B]: header 126.0 content 13.0 footer 0.0 (total 139.0)
Reply status: 1xx=0 2xx=50000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 2.77 system 7.18 (user 27.7% system 71.8% total 99.5%)
Net I/O: 1069.1 KB/s (8.8*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0